Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Rockxy is extracting the update and preparing the app bundle for installation.
zh_hans: Rockxy 正在解压更新并准备用于安装的应用程序包。

source: Rockxy is finishing the installation and will relaunch automatically.
zh_hans: Rockxy 正在完成安装，并将自动重新启动。

# Rockxy is listening on %@:%lld.
source: Rockxy is listening on %1$@:%2$lld.
zh_hans: Rockxy 正在监听 %1$@:%2$lld。

source: Rockxy is listening on this address now.
zh_hans: Rockxy 现在正在此地址上监听。

source: Rockxy is starting the proxy. Captured requests will appear here.
zh_hans: Rockxy 正在启动代理。捕获的请求将显示在此处。

source: Rockxy is up to date
zh_hans: Rockxy 已是最新版本

source: Rockxy is up to date.
zh_hans: Rockxy 已是最新版本。

source: Rockxy is using direct macOS proxy changes because %@. If Rockxy or Xcode stops unexpectedly, your Mac may stay behind a dead proxy until Rockxy restores it. Install or repair the helper tool for safer automatic cleanup.
zh_hans: 由于 %@，Rockxy 正在直接更改 macOS 代理。如果 Rockxy 或 Xcode 意外停止，你的 Mac 可能会一直使用失效的代理，直到 Rockxy 将其恢复。请安装或修复辅助工具，以便更安全地自动清理。

source: Rockxy is using its default root certificate.
zh_hans: Rockxy 正在使用其默认根证书。

source: Rockxy is verifying this custom root certificate and its private key.
zh_hans: Rockxy 正在验证此自定义根证书及其私钥。

source: Rockxy is waiting for the app to terminate so installation can finish safely.
zh_hans: Rockxy 正在等待 App 终止，以便安全完成安装。

source: Rockxy kept the app connected by returning this host to a protected encrypted tunnel.
zh_hans: Rockxy 通过将此主机重新置于受保护的加密隧道，使应用保持连接。

source: Rockxy kept the existing catalog unchanged and disabled Project edits to avoid overwriting data.
zh_hans: Rockxy 保持现有目录不变，并停用了项目编辑，以避免覆盖数据。

source: Rockxy must keep at least one Project.
zh_hans: Rockxy 必须至少保留一个项目。

source: Rockxy needs a Root CA certificate to inspect HTTPS traffic. This wizard will generate a local certificate, install it in your macOS Keychain, and verify the setup. No certificate data leaves your machine.
zh_hans: Rockxy 需要根 CA 证书才能检查 HTTPS 流量。此向导将生成本地证书，将其安装到你的 macOS 钥匙串，并验证设置。任何证书数据都不会离开这台 Mac。

source: Rockxy needs to be reopened before it can use the helper tool
zh_hans: Rockxy 需要重新打开才能使用辅助工具

source: Rockxy only installs local runtimes from an encrypted HTTPS source.
zh_hans: Rockxy 仅从加密的 HTTPS 源安装本地运行时。

source: Rockxy prepared a bounded evidence package for this captured failure.
zh_hans: Rockxy 已为此次捕获的失败准备了受限证据包。

source: Rockxy prepares a scoped shell for %@ pointed at the local proxy.
zh_hans: Rockxy 会为 %@ 准备一个指向本地代理的限定范围 Shell。

source: Rockxy provides the Dev Hub guide and temporary certificate share link; app-level TLS still depends on a debug network-security-config.
zh_hans: Rockxy 提供 Dev Hub 指南和临时证书共享链接；App 级 TLS 仍依赖调试 network-security-config。

source: Rockxy received status %lld and has no recent TLS rejection for this host.
zh_hans: Rockxy 收到状态 %lld，并且此主机最近没有 TLS 拒绝记录。

source: Rockxy reinstalled the helper but still cannot reach it.
zh_hans: Rockxy 已重新安装辅助工具，但仍无法访问它。

source: Rockxy removed stale helper files and asked macOS to reset Login and Background Items data.
zh_hans: Rockxy 已移除过时的辅助工具文件，并请求 macOS 重置登录项和后台项数据。

source: Rockxy removed stale helper files and launchd registration state.
zh_hans: Rockxy 已移除过时的辅助工具文件和 launchd 注册状态。

source: Rockxy safety range: 1–32,768. The selected model may allow less.
zh_hans: Rockxy 安全范围：1–32,768。选定的模型可能允许更小的值。

source: Rockxy saved the certificate export successfully.
zh_hans: Rockxy 已成功保存证书导出。

source: Rockxy Session
zh_hans: Rockxy 会话

source: Rockxy ships a dynamic route handler plus the next dev env block, including NODE_USE_ENV_PROXY, so server-side fetch can then route through Rockxy.
zh_hans: Rockxy 提供动态路由处理程序以及 next dev 环境配置块，其中包含 NODE_USE_ENV_PROXY，以便服务器端 fetch 随后可通过 Rockxy 路由。

source: Rockxy ships a Firefox settings snippet plus a cURL preflight step so you can confirm the proxy path before touching the browser.
zh_hans: Rockxy 提供 Firefox 设置片段和 cURL 预检步骤，以便你在更改浏览器前确认代理路径。

source: Automatic Setup prepares a scoped shell that sets JAVA_TOOL_OPTIONS proxy properties for the JVM. For a GUI development tool, quit it and use Choose & Open Developer App so Rockxy can apply the scoped environment and prepare recognized app-level proxy settings. For HTTPS interception, import the Rockxy root CA into the exact JVM or IDE trust store with keytool, add a Decrypt rule for the target application or host, then run the HttpClient sample to confirm capture.
zh_hans: 自动设置会准备一个作用域 shell，为 JVM 设置 JAVA_TOOL_OPTIONS 代理属性。对于 GUI 开发工具，请先退出，再使用“选择并打开开发者应用”，让 Rockxy 应用作用域环境并准备已识别的应用级代理设置。要拦截 HTTPS，请使用 keytool 将 Rockxy 根 CA 导入对应的 JVM 或 IDE 信任库，为目标应用或主机添加解密规则，然后运行 HttpClient 示例确认流量已被捕获。

source: Rockxy ships a manual reqwest snippet for HTTPS interception.
zh_hans: Rockxy 提供用于 HTTPS 拦截的手动 reqwest 代码片段。

source: Rockxy ships a Paw settings block plus a cURL preflight step so you can confirm the proxy path before sending from Paw.
zh_hans: Rockxy 提供 Paw 设置块和一个 cURL 预检步骤，以便你在从 Paw 发送前确认代理路径。

source: Rockxy ships a Postman settings block plus a cURL preflight so you can confirm the proxy path before touching the app.
zh_hans: Rockxy 提供 Postman 设置块和 cURL 预检，让你无需改动 App 即可先确认代理路径。

source: Rockxy ships a React Native fetch validation probe, Android network-security-config guidance, and Metro troubleshooting; proxy and certificate trust still belong to the underlying platform.
zh_hans: Rockxy 提供 React Native fetch 验证探针、Android network-security-config 指南和 Metro 故障排除；代理和证书信任仍由底层平台负责。

source: Rockxy ships a single docker run command that mounts the Rockxy PEM and probes capture through the local validation path.
zh_hans: Rockxy 提供一条 docker run 命令，用于挂载 Rockxy PEM 并通过本地验证路径探测捕获。

source: Rockxy ships an Insomnia settings block plus a cURL preflight step so you can confirm the proxy path before sending from the app.
zh_hans: Rockxy 提供 Insomnia 设置块和 cURL 预检步骤，让你在从 App 发送请求前确认代理路径。

source: Rockxy ships manual cURL examples for direct proxy flags and session environment variables.
zh_hans: Rockxy 提供手动 cURL 示例，用于直接代理标志和会话环境变量。

source: Rockxy ships manual Flutter snippets and a local capture check. The check confirms the probe reached Rockxy, not which device, emulator, simulator, or Dart runtime emitted it. Android Emulator no-code routing through a local VPN companion is not part of this manual flow.
zh_hans: Rockxy 提供手动 Flutter 代码片段和本地捕获检查。该检查确认探针已到达 Rockxy，但不确认是哪个设备、仿真器、模拟器或 Dart 运行时发出的。通过本地 VPN 伴侣应用对 Android Emulator 进行无代码路由不属于此手动流程。

source: Rockxy ships manual setup snippets for requests, httpx, aiohttp, and urllib3.
zh_hans: Rockxy 为 requests、httpx、aiohttp 和 urllib3 提供了手动设置代码片段。

source: Rockxy ships manual snippets for axios, Node core, and got.
zh_hans: Rockxy 提供适用于 axios、Node core 和 got 的手动配置片段。

source: Rockxy ships manual snippets for net/http and Resty.
zh_hans: Rockxy 提供适用于 net/http 和 Resty 的手动代码片段。

source: Rockxy ships manual snippets for net/http, http, and Faraday.
zh_hans: Rockxy 提供 net/http、http 和 Faraday 的手动代码片段。

source: Rockxy ships one shell-launch command and one main-process session.setProxy snippet, both pointed at 127.0.0.1 on the active port.
zh_hans: Rockxy 提供一个 shell 启动命令和一个主进程 session.setProxy 片段，两者都指向当前端口上的 127.0.0.1。

source: Rockxy signs generated host certificates with its default root.
zh_hans: Rockxy 使用其默认根证书为生成的主机证书签名。

source: Rockxy signs generated host certificates with this imported root.
zh_hans: Rockxy 使用此导入的根证书为生成的主机证书签名。

source: Rockxy still cannot reach the installed helper.
zh_hans: Rockxy 仍无法访问已安装的辅助工具。

source: Rockxy stops after the first matching script returns a result.
zh_hans: 首个匹配的脚本返回结果后，Rockxy 就会停止。

source: Rockxy tunnels matching HTTPS without decrypting, overriding any Decrypt rule.
zh_hans: Rockxy 会通过隧道传输匹配的 HTTPS 而不解密，并覆盖任何解密规则。

source: Rockxy uses 8,192 tokens by default and limits local inference to 32,768 tokens to avoid excessive memory pressure.
zh_hans: Rockxy 默认使用 8,192 个 token，并将本地推理限制为 32,768 个 token，以避免过大的内存压力。

source: Rockxy was updated or replaced while it was open. Quit and reopen Rockxy, then check the helper again.
zh_hans: Rockxy 在打开状态下被更新或替换。请退出并重新打开 Rockxy，然后再次检查辅助工具。

source: Rockxy will bind this address when the proxy starts.
zh_hans: 代理启动时，Rockxy 将绑定此地址。

source: Rockxy will create an editable draft. Nothing is sent until you press Send in Compose.
zh_hans: Rockxy 将创建可编辑的草稿。只有在 Compose 中按下“发送”后才会发送内容。

source: Rockxy will create this response file when the rule is saved.
zh_hans: 保存规则时，Rockxy 将创建此响应文件。

source: Rockxy will install Ollama.app inside the selected folder.
zh_hans: Rockxy 会将 Ollama.app 安装到所选文件夹中。

source: Rockxy will relaunch after installation completes.
zh_hans: 安装完成后，Rockxy 将重新启动。

source: Rockxy will remove the custom %1$@ certificate “%2$@”%3$@ and delete its private key from the Keychain. This cannot be undone.
zh_hans: Rockxy 将移除自定义 %1$@ 证书“%2$@”%3$@，并从钥匙串中删除其私钥。此操作无法撤销。

source: Rockxy will remove the custom root certificate “%@” and resume signing intercepted TLS connections with its generated root. Existing custom server and client certificates are kept.
zh_hans: Rockxy 将移除自定义根证书“%@”，并恢复使用其生成的根证书为拦截的 TLS 连接签名。现有自定义服务器和客户端证书会保留。

source: Rockxy will remove these exclusions from the system proxy configuration for new connections.
zh_hans: Rockxy 将从新连接的系统代理配置中移除这些排除项。

source: Rockxy will replace the current catalog with one default Project. A bounded regular catalog is preserved as catalog.recovery.json. Captured traffic, sessions, rules, and favorites are not deleted.
zh_hans: Rockxy 会将当前目录替换为一个默认项目。有界的常规目录会保留为 catalog.recovery.json。捕获的流量、会话、规则和个人收藏不会被删除。

source: Rockxy will request GitHub Gist permission using OAuth device authorization.
zh_hans: Rockxy 将使用 OAuth 设备授权请求 GitHub Gist 权限。

source: Rockxy will stop capture, request administrator approval, remove stale helper files and registration state, then reinstall the helper from this app. Use this when Install, Retry, Update, or Reinstall cannot recover the helper.
zh_hans: Rockxy 将停止捕获、请求管理员批准、移除过时的辅助工具文件和注册状态，然后从此应用重新安装辅助工具。 当“安装”、“重试”、“更新”或“重新安装”都无法恢复辅助工具时，请使用此功能。

source: Rockxy will stop capture, request administrator approval, remove stale launchd and privileged helper files, then reinstall the helper from the current app bundle. System proxy settings may be restored during the reset. Use this only when install, uninstall, and recheck are stuck.
zh_hans: Rockxy 将停止捕获、请求管理员批准、移除过时的 launchd 和特权辅助工具文件，然后从当前应用包重新安装辅助工具。重置期间系统代理设置可能会被恢复。 仅在安装、卸载和重新检查均卡住时才使用此功能。

source: Rockxy will use networksetup and may ask for your password.
zh_hans: Rockxy 将使用 networksetup，并可能要求你输入密码。

source: Rockxy withholds body-level conclusions because capture truncated the response.
zh_hans: 由于捕获截断了响应，Rockxy 不会对正文作出结论。

source: Rockxy-owned response file available
zh_hans: 有由 Rockxy 生成的响应文件可用

source: Root CA Certificate
zh_hans: 根 CA 证书

source: Root CA certificate generated
zh_hans: 根 CA 证书已生成

source: Root CA certificate generated successfully.
zh_hans: 根 CA 证书生成成功。

source: Root CA exported successfully.
zh_hans: 根 CA 导出成功。

source: Root CA generated but not installed
zh_hans: 根 CA 已生成但未安装

source: Root CA generated successfully.
zh_hans: 已成功生成根 CA。

source: Root CA installed and trusted in Keychain.
zh_hans: 根 CA 已在钥匙串中安装并受信任。

source: Root CA installed and trusted.
zh_hans: 根 CA 已安装并受信任。

source: Root CA installed but not trusted
zh_hans: 根 CA 已安装但不受信任

source: Root CA Installed, Not Trusted
zh_hans: 根 CA 已安装但不受信任

source: Root CA not generated
zh_hans: 尚未生成根 CA

source: Root CA Not Installed
zh_hans: 根 CA 未安装

source: Root CA sharing link started.
zh_hans: 根 CA 共享链接已启动。

source: Root CA sharing URL copied.
zh_hans: 根 CA 共享 URL 已复制。

source: Root CA status unavailable
zh_hans: 根 CA 状态不可用

source: Root CA Status
zh_hans: 根 CA 状态

source: Root CA status: %@
zh_hans: 根 CA 状态：%@

source: Root CA trusted
zh_hans: 根 CA 已受信任

source: Root CA Trusted
zh_hans: 根 CA 受信任

source: Root Certificate
zh_hans: 根证书

source: Root Certificate as DER…
zh_hans: 根证书导出为 DER…

source: Root Certificate as P12…
zh_hans: 根证书（P12 格式）…

source: Root Certificate as PEM…
zh_hans: 导出 PEM 格式的根证书…

source: Route eligible captured traffic through an upstream proxy.
zh_hans: 通过上游代理路由符合条件的已捕获流量。

source: Route handler
zh_hans: 路由处理程序

source: Route macOS network traffic through Rockxy for capture.
zh_hans: 将 macOS 网络流量通过 Rockxy 路由以进行捕获。

source: Routing active
zh_hans: 路由已启用

# Row %lld: %@
source: Row %1$lld: %2$@
zh_hans: 第 %1$lld 行：%2$@

source: RPC completed
zh_hans: RPC 已完成

source: RPC error
zh_hans: RPC 错误

source: RPC Error
zh_hans: RPC 错误

source: Rule
zh_hans: 规则

source: Rule Action
zh_hans: 规则操作

source: Rule affected this request: %@
zh_hans: 影响此请求的规则：%@

source: Rule behavior
zh_hans: 规则行为

source: Rule Details
zh_hans: 规则详细信息

source: Rule Impact
zh_hans: 规则影响

source: Rule Info
zh_hans: 规则信息

source: Rule limit reached for this category
zh_hans: 已达到此类别的规则上限

source: Rule matched
zh_hans: 规则已匹配

source: Rule name
zh_hans: 规则名称

source: Rule Pattern
zh_hans: 规则模式

source: rules
zh_hans: 规则

source: Rules
zh_hans: 规则

source: Rules decide which HTTPS hosts Rockxy decrypts. Other hosts still pass through Rockxy as opaque TLS tunnels.
zh_hans: 规则决定 Rockxy 解密哪些 HTTPS 主机。其他主机仍会作为不透明的 TLS 隧道通过 Rockxy。

source: Rules Hit
zh_hans: 命中规则

source: Run Every Matching Script
zh_hans: 运行每个匹配的脚本

source: Run Locally
zh_hans: 在本地运行

source: Run one known HTTPS flow from the app or system UI and confirm Rockxy captures it before debugging deeper flows.
zh_hans: 从 App 或系统 UI 发起一次已知的 HTTPS 流程，并确认 Rockxy 能捕获它，再调试更深层的流程。

source: Run one throwaway container to confirm host.docker.internal + the mounted CA work end-to-end.
zh_hans: 运行一个一次性容器，确认 host.docker.internal 和挂载的 CA 可端到端正常工作。

source: Run one throwaway curlimages/curl container with HTTP_PROXY pointed at host.docker.internal and the PEM mounted in, then let Rockxy catch the probe.
zh_hans: 运行一个一次性的 curlimages/curl 容器，将 HTTP_PROXY 指向 host.docker.internal 并挂载 PEM，然后让 Rockxy 捕获探测请求。

source: Run Probe Again
zh_hans: 再次运行探测

source: Run script on:
zh_hans: 脚本运行于：

source: Run Test Again
zh_hans: 再次运行测试

source: Run the local probe again and make sure the selected runtime sends it through Rockxy's proxy port.
zh_hans: 再次运行本地探测，并确保所选运行时通过 Rockxy 的代理端口发送该探测。

source: Run the local validation probe and wait for the first matching capture.
zh_hans: 运行本地验证探测并等待首次匹配的捕获。

source: Run the model on this Mac with no API usage fees. Rockxy checks the local runtime before model and traffic actions.
zh_hans: 在这台 Mac 上运行模型，无需支付 API 使用费。Rockxy 会在模型和流量操作前检查本地运行时。

source: Run the React Native fetch probe from the Validate tab and confirm Rockxy captures the target-specific local validation probe before you debug deeper app flows.
zh_hans: 从“验证”标签页运行 React Native fetch 探测，确认 Rockxy 捕获了目标专用的本地验证探测，然后再调试更深层的应用流程。

source: Run the selected %1$@ local validation probe and wait for Rockxy to capture GET %2$@. This confirms the probe reached Rockxy through the proxy, but it does not attribute the request to a specific app, process, device, simulator, emulator, or runtime.
zh_hans: 运行所选的 %1$@ 本地验证探针，并等待 Rockxy 捕获 GET %2$@。这确认探针已通过代理到达 Rockxy，但不会将该请求归因于特定的应用、进程、设备、模拟器、仿真器或运行时。

source: Run the test request again and make sure it points at the Rockxy proxy port.
zh_hans: 再次运行测试请求，并确保它指向 Rockxy 代理端口。

source: Run the Validate tab's generated request from your Flutter client and confirm Rockxy captures it before you debug broader flows. This validates the proxy path, not the exact device, emulator, simulator, or Dart runtime that emitted the request.
zh_hans: 从 Flutter 客户端运行“验证”标签页生成的请求，并在调试更广泛的流程前确认 Rockxy 已捕获该请求。这会验证代理路径，而非发出请求的确切设备、仿真器、模拟器或 Dart 运行时。

source: Run this probe while Rockxy waits for the request.
zh_hans: 在 Rockxy 等待请求时运行此探测。

source: Running
zh_hans: 正在运行

source: Running on port %lld
zh_hans: 正在端口 %lld 上运行

source: Runtime
zh_hans: 运行时

source: Runtime Events
zh_hans: 运行时事件

source: Runtime Events…
zh_hans: 运行时事件…

source: Runtime not installed
zh_hans: 运行时未安装

source: Runtime Session
zh_hans: 运行时会话

# Runtime setup failed while running %@: %@
source: Runtime setup failed while running %1$@: %2$@
zh_hans: 运行 %1$@ 时运行时设置失败：%2$@

source: Runtime snippet
zh_hans: 运行时代码片段

source: Runtime verification produced more output than Rockxy allows.
zh_hans: 运行时验证产生的输出超过了 Rockxy 允许的量。

source: Runtimes
zh_hans: 运行时

source: Same host, method, and path in the bounded investigation scope.
zh_hans: 受限调查范围内主机、方法和路径均相同。

source: Save
zh_hans: 保存

source: Save & Activate
zh_hans: 保存并激活

source: Save & Switch
zh_hans: 保存并切换

source: Save a complete provider configuration to enable model access.
zh_hans: 请保存完整的提供商配置以启用模型访问。

source: Save a reusable view of the traffic relevant to one task.
zh_hans: 为与某项任务相关的流量保存可重复使用的视图。

source: Save blocked: %@
zh_hans: 保存被阻止：%@

source: Save blocked: the matching pattern is not a valid regular expression.
zh_hans: 保存被阻止：匹配模式不是有效的正则表达式。

source: Save blocked: the script name cannot be empty.
zh_hans: 保存被阻止：脚本名称不能为空。

source: Save Body As…
zh_hans: 正文另存为…

source: Save Configuration
zh_hans: 保存配置

source: Save Current Filter
zh_hans: 保存当前筛选器

source: Save current message as new template...
zh_hans: 将当前消息另存为新模板...

source: Save failed
zh_hans: 保存失败

source: Save Failed
zh_hans: 保存失败

source: Save failed: %@
zh_hans: 保存失败：%@

source: Save Note
zh_hans: 保存备注

source: Save Request
zh_hans: 保存请求

source: Save Session…
zh_hans: 保存会话…

source: Save skipped: no script is loaded in the editor.
zh_hans: 已跳过保存：编辑器中未加载脚本。

source: Save Template
zh_hans: 保存模板

source: Save the public Rockxy root CA as a PEM file
zh_hans: 将公开 Rockxy 根 CA 保存为 PEM 文件

source: Save the selected request to the Library.
zh_hans: 将所选请求保存到资料库。

source: Save this Request
zh_hans: 保存此请求

source: Saved
zh_hans: 已保存

source: Saved · Captured
zh_hans: 已保存 · 已捕获

source: Saved (not active)
zh_hans: 已保存（未启用）

source: Saved (script quota reached — not active)
zh_hans: 已保存（已达到脚本配额，未激活）

source: Saved and Active!
zh_hans: 已保存并激活！

source: Saved configuration
zh_hans: 已保存的配置

source: Saved credential removed.
zh_hans: 已保存的凭据已移除。

source: Saved in Keychain. Enter a new key to replace it.
zh_hans: 已保存在钥匙串中。输入新密钥以替换它。

source: Saved listener settings apply after the proxy restarts. The live endpoint above stays active until then.
zh_hans: 代理重新启动后，保存的监听器设置才会生效。在此之前，上方的实时端点仍保持可用。

source: Saved locally in macOS Keychain for this profile
zh_hans: 已在 macOS 钥匙串中为此配置存储到本地

source: Saved Request
zh_hans: 已保存的请求

source: Saved Response
zh_hans: 已保存的响应

source: Saved upstream proxy credentials are unavailable. Enter the username and password again.
zh_hans: 已保存的上游代理凭据不可用。请重新输入用户名和密码。

source: Saved with
zh_hans: 保存方式

source: Saved, but script failed to load
zh_hans: 已保存，但脚本加载失败

source: Saved, but the 10-enabled-script quota is reached. Disable another script to activate this one.
zh_hans: 已保存，但已达到启用 10 个脚本的配额。请停用其他脚本以激活此脚本。

source: Saving…
zh_hans: 正在保存…

source: Scan the temporary certificate link
zh_hans: 扫描临时证书链接

source: Schema
zh_hans: 架构

source: Schema File Name
zh_hans: 架构文件名

source: Schema Import Unavailable
zh_hans: 架构导入不可用

source: Schema Limit Reached
zh_hans: 已达到架构上限

source: Schema Storage Unavailable
zh_hans: 架构存储不可用

source: Schema-based Protobuf decoding is not implemented in this build.
zh_hans: 此构建尚未实现基于架构的 Protobuf 解码。

source: Scope
zh_hans: 范围

source: Script
zh_hans: 脚本

source: Script Editor
zh_hans: 脚本编辑器

source: Script is valid
zh_hans: 脚本有效

source: Script List…
zh_hans: 脚本列表…

source: Script name
zh_hans: 脚本名称

source: Script plugin limit reached (maximum %lld)
zh_hans: 已达到脚本插件上限（最多 %lld 个）

source: Script saved and active.
zh_hans: 脚本已保存并生效。

source: Scripting
zh_hans: 脚本

source: Scripting is off. Enabled scripts are kept, but none run until you turn Scripting on.
zh_hans: 脚本功能已关闭。已启用的脚本会保留，但在你开启脚本功能前不会运行。

source: Scripting is on, but no script is enabled. Traffic passes through unchanged.
zh_hans: 脚本功能已开启，但没有启用任何脚本。流量将原样通过。

source: SCRIPTING OFF
zh_hans: 脚本已关闭

source: Scripting runs JavaScript hooks that inspect or modify requests and responses programmatically, beyond what a static rule does.
zh_hans: 脚本功能运行 JavaScript 钩子，以编程方式检查或修改请求与响应，能力超出静态规则。

source: Scroll Beyond The Last Line
zh_hans: 滚动到最后一行之后

source: Search Allow List rules
zh_hans: 搜索允许列表规则

source: Search app or domain
zh_hans: 搜索 App 或域名

source: Search app or domain (⌘⇧F)
zh_hans: 搜索应用或域名 (⌘⇧F)

source: Search app or domain (⌘F)
zh_hans: 搜索 App 或域名（⌘F）

source: Search Block List rules
zh_hans: 搜索阻止列表规则

source: Search Breakpoint rules
zh_hans: 搜索断点规则

source: Search captured applications
zh_hans: 搜索捕获的应用程序

source: Search captured domains
zh_hans: 搜索捕获的域名

source: Search captured paths
zh_hans: 搜索已捕获路径

source: Search conversations
zh_hans: 搜索对话

source: Search field
zh_hans: 搜索字段

source: Search for Rockxy CA, open the certificate, and expand Trust.
zh_hans: 搜索 Rockxy CA，打开证书，然后展开“信任”。

source: Search Full Proxy Bypass entries
zh_hans: 搜索完全绕过代理条目

source: Search header names
zh_hans: 搜索标头名称

source: Search host patterns
zh_hans: 搜索主机模式

source: Search HTTPS decryption rules
zh_hans: 搜索 HTTPS 解密规则

source: Search Map Local rules
zh_hans: 搜索 Map Local 规则

source: Search Map Remote rules
zh_hans: 搜索 Map Remote 规则

source: Search Modify Header rules
zh_hans: 搜索修改标头规则

source: Search names, IDs, errors
zh_hans: 搜索名称、ID、错误

source: Search Network Conditions rules
zh_hans: 搜索网络条件规则

source: Search Plugins
zh_hans: 搜索插件

source: Search rules
zh_hans: 搜索规则

source: Search runtime events
zh_hans: 搜索运行时事件

source: Search scripts
zh_hans: 搜索脚本

source: Search setups
zh_hans: 搜索设置

source: Search shortcuts
zh_hans: 搜索快捷键

source: Search templates
zh_hans: 搜索模板

source: Search titles and messages
zh_hans: 搜索标题和消息

source: Search values seen in captured traffic
zh_hans: 搜索在已捕获流量中出现的值

source: Search...
zh_hans: 搜索...

source: Secret Gist
zh_hans: 私密 Gist

source: Section
zh_hans: 部分

source: Secure
zh_hans: 安全

source: Secure Web Proxy (HTTPS)
zh_hans: 安全 Web 代理（HTTPS）

source: Select
zh_hans: 选择

source: Select a frame to inspect its payload.
zh_hans: 选择一个帧以检查其有效载荷。

source: Select a gRPC message frame to inspect its payload.
zh_hans: 选择一个 gRPC 消息帧以检查其有效载荷。

source: Select a local directory to serve files from
zh_hans: 选择用于提供文件的本地目录

source: Select a local file to serve for matched requests
zh_hans: 选择用于响应匹配请求的本地文件

source: Select a plugin from the list to view its details and configuration.
zh_hans: 从列表中选择一个插件以查看其详细信息和配置。

source: Select a Project
zh_hans: 选择一个项目

source: Select a Protocol Buffers schema file with a .proto extension.
zh_hans: 选择一个扩展名为 .proto 的 Protocol Buffers 架构文件。

source: Select a request to inspect
zh_hans: 选择要检查的请求

source: Select a request to investigate, or type a question below.
zh_hans: 选择要调查的请求，或在下方输入问题。

source: Select a request to publish to Gist
zh_hans: 选择要发布到 Gist 的请求

source: Select a request to see diagnostics and related traffic.
zh_hans: 选择一个请求以查看诊断和相关流量。

source: Select a request to share
zh_hans: 选择要共享的请求

source: Select a request to use the bottom inspector
zh_hans: 选择一个请求以使用底部检查器

source: Select a runtime event to inspect its identifiers, timing, and metadata.
zh_hans: 选择一个运行时事件以检查其标识符、时序和元数据。

source: Select a successful request with the same method and path, then run Compare again.
zh_hans: 选择方法和路径相同的成功请求，然后再次运行“比较”。

source: Select a template, or create one to start with a valid HTTP sample.
zh_hans: 选择一个模板，或创建模板以从有效的 HTTP 示例开始。

source: Select All
zh_hans: 全选

source: Select at least one request before publishing to Gist.
zh_hans: 发布到 Gist 前，请至少选择一个请求。

source: Select at least one request to investigate.
zh_hans: 请至少选择一个要调查的请求。

source: Select Next Tab
zh_hans: 选择下一个标签页

source: Select one request to detach its Inspector
zh_hans: 选择一个请求以分离其检查器

source: Select one request to inspect payload and timing details.
zh_hans: 选择一个请求以检查有效载荷和时序详细信息。

source: Select one request to inspect raw payload, or exactly two requests to compare.
zh_hans: 选择一个请求以检查原始有效载荷，或恰好选择两个请求进行比较。

source: Select Paused Traffic
zh_hans: 选择已暂停流量

source: Select paused traffic to apply changes
zh_hans: 选择已暂停的流量以应用更改
